БухЭксп/ChartsOfCharacteristicTypes/CW_РеестрыНДС0ЯчейкиПриложений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<ChartOfCharacteristicTypes>
		<Properties>
			<Name>CW_РеестрыНДС0ЯчейкиПриложений</Name>
			<Type>
				<v8:Type>xs:boolean</v8:Type>
				<v8:Type>xs:string</v8:Type>
				<v8:Type>xs:dateTime</v8:Type>
				<v8:Type>xs:decimal</v8:Type>
				<v8:NumberQualifiers>
					<v8:Digits>16</v8:Digits>
					<v8:FractionDigits>2</v8:FractionDigits>
				</v8:NumberQualifiers>
				<v8:StringQualifiers>
					<v8:Length>150</v8:Length>
				</v8:StringQualifiers>
				<v8:DateQualifiers>
					<v8:DateFractions>Date</v8:DateFractions>
				</v8:DateQualifiers>
			</Type>
			<Hierarchical>true</Hierarchical>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ИмяЯчейки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяГруппы</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерКолонки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЯчейкаНалоговаяБаза</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЯчейкаНумерации</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонтролироватьЗаполнение</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПриложениеПоВидуТранспорта</Name>
					<Type>
						<v8:Type>cfg:EnumRef.CW_РеестрыНДС0Приложения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользуютсяДополнительныеСтроки</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЯчейкаПримечание</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</ChartOfCharacteristicTypes>
</MetaDataObject>

БухЭксп/ChartsOfCharacteristicTypes/CW_РеестрыНДС0ЯчейкиПриложений/Forms/ФормаЭлемента/Ext/Form/Module.bsl
&НаКлиенте
Процедура ИмяЯчейкиПриИзменении(Элемент)
	
	Объект.ИмяГруппы = Лев(Объект.ИмяЯчейки, 6);
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ТолькоПросмотр = (Параметры.ТолькоПросмотр = Истина);  // также может быть Неопределено

КонецПроцедуры

&НаКлиенте
Процедура ВключитьВозможностьРедактирования(Команда)

	ТолькоПросмотр = Ложь;
	Элементы.ФормаВключитьВозможностьРедактирования.Доступность = Ложь;

КонецПроцедуры

&НаКлиенте
Процедура ЯчейкаНумерацииПриИзменении(Элемент)
	ОбработатьНазначениеЯчейки(Объект.ЯчейкаНумерации, Ложь, Ложь);
КонецПроцедуры

&НаКлиенте
Процедура ЯчейкаНалоговаяБазаПриИзменении(Элемент)
	ОбработатьНазначениеЯчейки(Ложь, Объект.ЯчейкаНалоговаяБаза, Ложь);
КонецПроцедуры

&НаКлиенте
Процедура ЯчейкаПримечаниеПриИзменении(Элемент)
	ОбработатьНазначениеЯчейки(Ложь, Ложь, Объект.ЯчейкаПримечание)
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьНазначениеЯчейки(Знач ЯчейкаНумерации, Знач ЯчейкаНалоговаяБаза, Знач ЯчейкаПримечание)
	
	Объект.ЯчейкаНумерации 		= ЯчейкаНумерации;
	Объект.ЯчейкаНалоговаяБаза 	= ЯчейкаНалоговаяБаза; 
	Объект.ЯчейкаПримечание 	= ЯчейкаПримечание;
	
КонецПроцедуры
